; domain
(define (domain avions)
  (:requirements :strips :typing)

  (:types
    avion cargaison aeroport)

  (:predicates
    (situe ?x - (either avion cargaison) ?y - aeroport)
    (dans ?x - cargaison ?y - avion)
    (vide ?x - avion))

  (:action charger
    :parameters (?x - cargaison ?y - avion ?z - aeroport)
    :precondition (and (situe ?x ?z) (situe ?y ?z) (vide ?y))
    :effect (and (not (situe ?x ?z)) (not (vide ?y)) (dans ?x ?y)))

  (:action voler
    :parameters (?x - avion ?y - aeroport ?z - aeroport)
    :precondition (situe ?x ?y)
    :effect (and (not (situe ?x ?y)) (situe ?x ?z)))

  (:action decharger
    :parameters (?x - cargaison ?y - avion ?z - aeroport)
    :precondition (and (dans ?x ?y) (situe ?y ?z))
    :effect (and (not (dans ?x ?y)) (situe ?x ?z) (vide ?y)))
)

; problem
(define (problem avions-problem)
  (:domain avions)
  
  (:objects
    a1 a2 - avion
    c1 c2 c3 - cargaison
    teg cdg bar - aeroport)

  (:init
    (situe a1 teg)
    (situe a2 teg)
    (situe c1 teg)
    (situe c2 teg)
    (situe c3 teg)
    (vide a1)
    (vide a2))

  (:goal
    (and
      (situe a1 cdg)
      (situe a2 cdg)
      (situe c1 bar)
      (situe c2 bar)
      (situe c3 bar)
    )
  )
)

; plan
1. (charger c1 a1 teg)
   deleted: (situe c1 teg) (vide a1)
   added: (dans c1 a1)
   goals met: 0 of 5
2. (charger c3 a2 teg)
   deleted: (situe c3 teg) (vide a2)
   added: (dans c3 a2)
   goals met: 0 of 5
3. (voler a1 teg bar)
   deleted: (situe a1 teg)
   added: (situe a1 bar)
   goals met: 0 of 5
4. (voler a2 teg cdg)
   deleted: (situe a2 teg)
   added: (situe a2 cdg)
   goals met: 1 of 5
5. (decharger c1 a1 bar)
   deleted: (dans c1 a1)
   added: (situe c1 bar) (vide a1)
   goals met: 2 of 5
6. (decharger c3 a2 cdg)
   deleted: (dans c3 a2)
   added: (situe c3 cdg) (vide a2)
   goals met: 2 of 5
7. (voler a1 bar cdg)
   deleted: (situe a1 bar)
   added: (situe a1 cdg)
   goals met: 3 of 5
8. (voler a2 cdg teg)
   deleted: (situe a2 cdg)
   added: (situe a2 teg)
   goals met: 2 of 5
9. (charger c3 a1 cdg)
   deleted: (situe c3 cdg) (vide a1)
   added: (dans c3 a1)
   goals met: 2 of 5
10. (charger c2 a2 teg)
   deleted: (situe c2 teg) (vide a2)
   added: (dans c2 a2)
   goals met: 2 of 5
11. (voler a1 cdg bar)
   deleted: (situe a1 cdg)
   added: (situe a1 bar)
   goals met: 1 of 5
12. (voler a2 teg bar)
   deleted: (situe a2 teg)
   added: (situe a2 bar)
   goals met: 1 of 5
13. (decharger c2 a2 bar)
   deleted: (dans c2 a2)
   added: (situe c2 bar) (vide a2)
   goals met: 2 of 5
14. (decharger c3 a1 bar)
   deleted: (dans c3 a1)
   added: (situe c3 bar) (vide a1)
   goals met: 3 of 5
15. (voler a1 bar cdg)
   deleted: (situe a1 bar)
   added: (situe a1 cdg)
   goals met: 4 of 5
16. (voler a2 bar cdg)
   deleted: (situe a2 bar)
   added: (situe a2 cdg)
   goals met: 5 of 5
